<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<%-- 
		성장과정 : 
		1. IT를 선택한 계기
		- 저는 초등학생 시절부터 게임자체에 관심을 가지고 오랫동안 플레이하면서 자랐습니다. 그저 게임만 하면 재밌던 시절에서
		어느새 저는 재밌게만 플레이하던 사람에서 불편한 점이나 이해 안가는 버그, 논리적으로 맞지않는 게임의 패턴을 보며
		왜 이사람은 이런식으로 게임을 개발하고 돈을받고 팔아먹는가 하는 생각을 가지게되면서 it분야 자체에 관심이 생겼습니다. 
		
		2. 교육과정을 통해 어떤것을 배웠고, 어떤 주제로 프로젝트를했다.
		- 2개월간의 교육과정을 통해 이쪽분야에 관심은 있었으나 그 어떤것도 몰랐던 저는 어느새 잘하시는 분이 보면 살짝 조잡하게 보일지라도
		주제에 맞는 프로그램을 작성할수 있는 능력을 갖추게 되었고, pc방 관리 프로그램주제로 프로젝트를 해봤습니다.
		
		3. 이러한 에피소드를 통해 이러한 장점을 얻었다, 이런 특기를 길렀다.
		-성실함을 기르게 되었는데 이와 관련해 고쳐야함
		
		4. it가 적성에 맞다는걸 확인한 계기
		- 강사님이 과제로 내주신 것들을 직접 풀어보면서 시간가는줄 모르고 고민하며 풀고, 풀어졌을때 느껴지는 쾌감을 얻는
		저의 모습을 발견하면서 it쪽 길이 제 적성에 맞구나를 느꼈습니다.
		
		5. 000한 개발자가 되기로 목표를 정하고 어떻게 노력했다 등
		
		성격의 장단점
		* A라는 단점을 B라는 장점으로
		- 책임감은 저의 장점이자 단점입니다. 먼저 단점이라고 느껴지게 된 계기는 저의 다른 성격과 맞물리게 되면서 입니다.
		 저는 귀찮음이 심한편인데 좋아서 하는 일이 아닌 억지로 떠맡거나 할 사람이 없어서 하게된 일이나 직위를 맡게 되면 책임감에 대한 부담을
		 너무 크게 느끼게 되어서 스트레스를 크게 받으면서 부담감을 지우기위해 책임을 회피하게 합니다. 다만	이는 큰 장점으로도 변할수가 있었는데,
		 제가 좋아하거나 관심이 가는 부분은 책임감이 작용하여 시간 가는줄도 모르고 몰두하여 마무리를 합니다.
		- 또다른 단점인 귀찮음은 이전엔 저 자신에대해 실망하고 좌절시키도기 했었지만 IT에 관심이 생겨 공부하게된 이후로는 오히려 장점으로 생각하게 되었습니다.
		그렇게 생각하게 된 계기는 코딩을 하면서 반복적인 코드나 긴 코드를 익숙하지 않다면 적지만 익숙하다면 어떻게든 줄이거나 없앨수있는 방안을 생각해보게 되어
		검색을 해보고 또 그런 검색을 통해 아 이렇게도 쓸수있구나를 배우며 흥미가 더 커지는 시너지를 가지게 되었습니다.
		
		1. 구체적 목표에 맞는 구체적 노력 -- 성장과정에 있지만, 한번 더 반복
		ex) 000 개발자가 되기위해 6개월간의 국비지원 교육을 받으며 자격증/ 프로젝트/ 궁금한 점
		이 있을시 강사님께 질문/ 개별 공부/ 개발 서적/ ChatGPT활용/ 000 자격증 취득 준비 등등등)
		- 백엔드 개발자가 되기위해 6개월간의 국비지원 교육을 받으며, 정보처리기사 자격증을 얻기 위해 노력했으며, 프로젝트 진행중 또는 언어에 관한 궁금증을 해결하기위해
		혼자서 검색을 해가며 찾아보거나, 주변에 저보다 훨씬 잘하시는분들께 여쭤봐가며 해결하며 이해하고 습득해왔습니다.
		
		2. 입사후에도, 1번의 구체적 노력처럼 '어떻게' 해서 ex) 자격증취득, 개인 역량 증진을 위한 노력, 부족한 점을 보완하기 위한 노력 등등)
		어떠한 개발자/ 어떤 팀원/ 어떤 직원 이/가 되도록 노력할 것 입니다. or 되겠습니다. or 어떠한 성과를 내겠습니다.
		- 입사후에는 정보처리기사( 획득했거나 미획득할 경우 나눔) 자격증을 위해 공부했던것처럼 책과, 인터넷을 통해 공부하며, 실력증진을 위해 
		코딩 사이트 또는 개발자 포럼등을 보며 배워나가겠습니다. 현재 저의 부족한점은 코드 자체에 아주 익숙하지 않다는것인데 이를 보완하기위해 
		주중에는 못해도 1일 1커밋을 하고있습니다. 
		
		+ 입사 후 포부에 '정보처리기사, sqld, 리눅스 마스터, ADsP 등등 자격증 명칭' 을 기재해주면 구체적 목표 표현 & 신뢰도 상승의 효과
		
		
	 --%>
</body>
</html>